let value = prompt ('enter num')
console.log(value);
let num = +value // преобразуем в число, проверка number не требуется, тк все значения будут number
console.log(typeof (num)); // все равно выводим проверку, тк проверка дана в задаче
if (isNaN (num)) {
  console.log('Упс, кажется, вы ошиблись'); // если ввели не число, то выпадает NaN  - сообщаем об ошибке
} else if (value === null) {
  console.log('Значение не было введено');
} else {
  num = ( num & 1 ) // проверка на четность через побитовый &
   if (num == 0) {
   console.log('четное');
  } else {
   console.log('не четное');
  }
}

// Всё верно, но не предусмотрен вариант, когда пользователь не ввел значение и нажал вместо этого кнопку Отмена. В таком случае prompt вернет значение null. Сейчас в таком случае выводится, что число четное, что не совсем правильно, т.к. никакое число не было введено. Выше показала, как можно обработать такую ситуацию.